In [1]:
import numpy as np
import pandas as pd

In [2]:
datam = [1,2,39,67,90]

In [3]:
datam

[1, 2, 39, 67, 90]

In [4]:
pd.DataFrame(datam, columns=["column_name"])

   column_name
0            1
1            2
2           39
3           67
4           90

In [5]:
m = np.arange(1,10).reshape(3,3)

In [6]:
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [7]:
pd.DataFrame(m, columns=["var1","var2","var2"])

   var1  var2  var2
0     1     2     3
1     4     5     6
2     7     8     9

In [8]:
df = pd.DataFrame(m, columns=["var1","var2","var2"])

In [9]:
df

   var1  var2  var2
0     1     2     3
1     4     5     6
2     7     8     9

In [11]:
df.head(2)

   var1  var2  var2
0     1     2     3
1     4     5     6

In [12]:
df.tail(1)

   var1  var2  var2
2     7     8     9

In [13]:
df.columns

Index(['var1', 'var2', 'var2'], dtype='object')

In [14]:
for i in df.columns:
    print(i)

var1
var2
var2

In [15]:
df.columns = ["new1","new2","new3"]

In [16]:
df

   new1  new2  new3
0     1     2     3
1     4     5     6
2     7     8     9

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df.shape

(3, 3)

In [20]:
df.ndim

2

In [21]:
df.size

9

In [22]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [23]:
type(df.values)

numpy.ndarray

In [24]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [25]:
s1

array([2, 4, 4, 9, 1])

In [26]:
s2

array([6, 1, 4, 1, 8])

In [27]:
s3

array([7, 6, 1, 5, 7])

In [28]:
myDict = {"var1":s1, "var2":s2, "var3":s3}

In [29]:
myDict

{'var1': array([2, 4, 4, 9, 1]),
 'var2': array([6, 1, 4, 1, 8]),
 'var3': array([7, 6, 1, 5, 7])}

In [30]:
df1 = pd.DataFrame(myDict)

In [31]:
df1

   var1  var2  var3
0     2     6     7
1     4     1     6
2     4     4     1
3     9     1     5
4     1     8     7

In [32]:
pwd

'C:\\Users\\acer\\DS\\General_workspace'

In [33]:
df3 = pd.read_csv("ornekcsv.csv", delimiter = ";")

In [34]:
df3.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [35]:
df1

   var1  var2  var3
0     2     6     7
1     4     1     6
2     4     4     1
3     9     1     5
4     1     8     7

In [36]:
df1[1:3]

   var1  var2  var3
1     4     1     6
2     4     4     1

In [40]:
df1.index

RangeIndex(start=0, stop=5, step=1)

In [42]:
[i for i in df1.index]

[0, 1, 2, 3, 4]

In [43]:
df1.index = ["a","b","c","d","e"]

In [45]:
df1

   var1  var2  var3
a     2     6     7
b     4     1     6
c     4     4     1
d     9     1     5
e     1     8     7

In [46]:
df1["b":"d"]

   var1  var2  var3
b     4     1     6
c     4     4     1
d     9     1     5

In [47]:
"var2" in df1

True

In [48]:
"var5" in df1

False

In [50]:
df1["var1"][1:3]

b    4
c    4
Name: var1, dtype: int32

In [51]:
from numpy.random import randn
np.random.seed(101)

In [52]:
df3 = pd.DataFrame(randn(5,4), index = "A B C D E".split(), columns = "W X Y Z".split())

In [53]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
pd.DataFrame(randn(5,4), "A B C D E".split(), "W X Y Z".split())

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [55]:
df3["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [56]:
type(df3["W"])

pandas.core.series.Series

In [59]:
df3[["W"]]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [60]:
type(df3[["W"]])

pandas.core.frame.DataFrame

In [61]:
df3[["W","Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [62]:
df3["W"]["B":"D"]

B    0.651118
C   -2.018168
D    0.188695
Name: W, dtype: float64

In [63]:
df3.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [64]:
df3["A":"C"]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [68]:
df3["C":"C"]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001